-- phpMyAdmin SQL Dump
-- version 3.1.0
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2013 年 09 月 02 日 10:57
-- 服务器版本: 5.0.86
-- PHP 版本: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `sq_lehuo`
--

-- --------------------------------------------------------

--
-- 表的结构 `lh_join`
--

CREATE TABLE IF NOT EXISTS `lh_join` (
  `id` int(10) unsigned NOT NULL auto_increment COMMENT '主键',
  `user_id` int(10) unsigned NOT NULL COMMENT '提交用户',
  `store_uid` int(10) unsigned NOT NULL COMMENT '店铺所属人',
  `store_name` varchar(255) NOT NULL default '' COMMENT '店铺名',
  `trade` tinyint(2) NOT NULL COMMENT '所属行业',
  `estate` varchar(255) default NULL COMMENT '所属商业区',
  `draw` decimal(9,2) unsigned NOT NULL COMMENT '人均消费',
  `lng` double(20,17) NOT NULL default '0.00000000000000000' COMMENT '经度',
  `lat` double(20,17) NOT NULL default '0.00000000000000000' COMMENT '纬度',
  `address` varchar(255) NOT NULL default '' COMMENT '详细地址',
  `store_phone` char(11) NOT NULL default '' COMMENT '店主电话',
  `city` smallint(5) unsigned NOT NULL COMMENT '所属城市',
  `start_business` varchar(20) NOT NULL COMMENT '开业日期',
  `classification` tinyint(2) unsigned NOT NULL COMMENT '店铺属性，1总店，2分店',
  `official` varchar(10) NOT NULL COMMENT '负责人',
  `store_pic` int(10) unsigned NOT NULL COMMENT '店铺概览图',
  `licence_pic` int(10) unsigned NOT NULL COMMENT '店铺营业执照图片',
  `introduce` char(140) default '' COMMENT '简单介绍',
  `time` int(11) unsigned NOT NULL COMMENT '创建时间',
  `status` tinyint(2) NOT NULL default '1' COMMENT '商铺状态 0正常状态，1提交待审核，-2删除',
  PRIMARY KEY  (`id`),
  UNIQUE KEY `time` (`time`),
  KEY `lng` (`lng`,`lat`),
  KEY `lng_2` (`lng`),
  KEY `lat` (`lat`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='加盟店铺表' AUTO_INCREMENT=48 ;

--
-- 导出表中的数据 `lh_join`
--

INSERT INTO `lh_join` (`id`, `user_id`, `store_uid`, `store_name`, `trade`, `estate`, `draw`, `lng`, `lat`, `address`, `store_phone`, `city`, `start_business`, `classification`, `official`, `store_pic`, `licence_pic`, `introduce`, `time`, `status`) VALUES
(4, 1, 1, '北京KFC-1', 1, '西城', 50.00, 116.39523699999999000, 39.89920200000000200, '北京市西城区前门西大街正阳市场1号楼 ', '13761973824', 1, '2013', 1, '张三', 1, 6, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896144, 0),
(5, 1, 1, '上海KFC-1', 1, '淮海路', 75.00, 121.47497100000001000, 31.22307299999999900, '上海市黄浦区淮海路东段', '13761973824', 2, '2013', 1, '张三', 2, 8, '简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2简单介绍2', 1376896192, 0),
(21, 12, 14, '上海KFC-2', 1, '普陀', 0.00, 121.47490100000000000, 31.22369300000000100, '上海市黄浦区淮海路东段香港广场北座', '18221769749', 2, '2013年8月23日', 2, 'wade', 3, 16, '', 1377242118, 0),
(22, 12, 12, '上海KFC-3', 1, '浦东', 0.00, 121.47992700000000000, 31.22491300000000100, '上海市黄浦区淮海路东段柳林路65号', '13761951734', 2, '2013年8月23日', 2, 'wade', 4, 18, '', 1377242376, 0),
(23, 12, 12, '上海KFC-4', 2, '万达', 0.00, 121.47343600000001000, 31.22871100000000100, '上海市黄浦区人民广场人民大道221号', '13761951734', 2, '2013年8月25日', 2, 'wade', 5, 20, '', 1377398131, 0),
(24, 12, 12, '上海KFC-5', 2, '万达', 0.00, 121.48151500000000000, 31.23612400000000000, '上海市黄浦区南京路新世界休闲港湾', '13761951734', 2, '2013年8月25日', 2, 'wade', 7, 22, NULL, 1379398131, 0),
(25, 12, 12, '上海KFC-6', 2, '万达', 0.00, 121.49262800000000000, 31.23294299999999900, '上海市黄浦区中山东二路外滩105号', '13761951734', 2, '2013年8月25日', 2, 'wade', 9, 24, NULL, 1389398131, 0),
(26, 12, 12, '上海KFC-7', 3, '陆家嘴', 0.00, 121.50014100000000000, 31.23745400000000000, '上海市浦东新区陆家嘴西路168号正大广场8F03A室', '13761951734', 2, '2013年8月25日', 2, 'wade', 15, 6, NULL, 1319398131, 0),
(27, 12, 12, '上海KFC-8', 3, '陆家嘴', 0.00, 121.49543600000000000, 31.25830699999999900, '上海市虹口区通州路300号', '13761951734', 2, '2013年8月25日', 2, 'wade', 17, 8, NULL, 1329398131, 0),
(28, 12, 12, '上海KFC-9', 3, '陆家嘴', 0.00, 121.48182500000000000, 31.33677700000000100, '上海市宝山区长江南路553号', '13761951734', 2, '2013年8月25日', 2, 'wade', 19, 16, NULL, 1339398131, 0),
(29, 12, 12, '上海KFC-10', 4, '陆家嘴', 0.00, 121.63836800000000000, 31.20428600000000000, '上海市浦东新区高科中路2860号', '13761951734', 2, '2013年8月25日', 2, 'wade', 21, 18, NULL, 1339398132, 0),
(30, 12, 12, '上海KFC-11', 4, '浦东新区', 0.00, 121.69741900000001000, 31.19459500000000000, '上海市浦东新区新川路401号 ', '13761951734', 2, '2013年8月25日', 2, 'wade', 23, 20, NULL, 1339398133, 0),
(31, 1, 1, '北京KFC-2', 2, '西城', 50.00, 116.49197200000000000, 39.90051799999999800, '北京市朝阳区东四环中路76号 ‎', '13761973824', 1, '2013', 1, '张三', 1, 22, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896145, 0),
(32, 1, 1, '北京KFC-3', 3, '西城', 50.00, 116.20212199999999000, 39.90657600000000100, '北京市石景山区石景山路乙18号万达广场步行街1楼东南侧', '13761973824', 1, '2013', 1, '张三', 2, 24, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896146, 0),
(33, 1, 1, '北京KFC-4', 4, '西城', 50.00, 116.41696300000001000, 39.98205299999999300, '北京市朝阳区惠新西街23号', '13761973824', 1, '2013', 1, '张三', 3, 6, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896147, 0),
(34, 1, 1, '北京KFC-5', 1, '西城', 50.00, 116.42226500000000000, 39.86547999999999800, '北京市丰台区蒲芳路9号', '13761973824', 1, '2013', 1, '张三', 4, 8, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896148, 0),
(35, 1, 1, '深圳KFC-1', 1, '西城', 50.00, 114.12654900000000000, 22.55758600000000100, '广东省深圳市罗湖区春风路2021号', '13761973824', 317, '2013', 1, '张三', 5, 16, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896149, 0),
(36, 1, 1, '深圳KFC-2', 1, '西城', 50.00, 113.94184100000000000, 22.55378200000000200, '广东省深圳市南山区高新南四道30-6号', '13761973824', 317, '2013', 1, '张三', 7, 18, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896150, 0),
(37, 1, 1, '深圳KFC-3', 2, '福田', 50.00, 114.02423900000001000, 22.53919600000000000, '广东省深圳市福田区东涌路东涌路花好园岁宝百货1层A001', '13761973824', 317, '2013', 1, '张三', 9, 20, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896151, 0),
(38, 1, 1, '深圳KFC-4', 2, '福田', 50.00, 114.05513799999999000, 22.58421699999999900, '广东省深圳市福田区梅华路103号', '13761973824', 317, '2013', 1, '张三', 15, 22, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896152, 0),
(39, 1, 1, '深圳KFC-5', 3, '福田', 50.00, 113.95969400000001000, 22.59816400000000100, '广东省深圳市南山区西丽街道沙河西路与留仙大道交汇处西丽商业文化中心一层', '13761973824', 317, '2013', 1, '张三', 17, 6, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896153, 0),
(40, 1, 1, '深圳KFC-6', 4, '福田', 50.00, 113.46244799999999000, 23.14414800000000100, '广东省广州市黄埔区石化路123号', '13761973824', 317, '2013', 1, '张三', 19, 8, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896154, 0),
(41, 1, 1, '广州KFC-1', 1, '白云', 50.00, 113.25645400000001000, 23.20853400000000000, '广东省广州市白云区远景路172号', '13761973824', 316, '2013', 1, '张三', 21, 16, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896161, 0),
(42, 1, 1, '广州KFC-2', 2, '白云', 50.00, 113.35395800000001000, 23.19464999999999900, '广东省广州市天河区岳洲路13号', '13761973824', 316, '2013', 1, '张三', 23, 18, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896162, 0),
(43, 1, 1, '广州KFC-3', 3, '白云', 50.00, 113.27842700000001000, 23.12267999999999900, '广东省广州市海珠区昌岗中路211号', '13761973824', 316, '2013', 1, '张三', 1, 20, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896163, 0),
(44, 1, 1, '广州KFC-4', 4, '白云', 50.00, 113.35807800000001000, 23.16182600000000100, '广东省广州市天河区恒隆街3号', '13761973824', 316, '2013', 1, '张三', 2, 22, '简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1简单介绍1', 1376896164, 0),
(45, 17, 17, '乐活国际', 3, '深圳', 0.00, 113.90488499999999000, 22.51151700000000100, '广东省南山区前海路125店辅', '15999501309', 21, '2012年9月26日', 2, '李坤燕', 25, 26, '', 1377569055, 0),
(46, 7, 11, 'qqq', 2, '陆家嘴', 0.00, 121.50999600000000000, 31.23948899999999900, '上海市浦东新区浦东南路360号', '18516146011', 2, '2013年8月27日', 1, 'test', 27, 28, '', 1377582866, 0),
(47, 12, 12, '麦当劳', 1, '万达', 0.00, 121.45098800000000000, 31.33345299999999900, '上海市宝山区301号', '13761951734', 2, '2013年9月01日', 1, 'wade', 29, 30, '', 1378009227, 0);
